<img src=images/StoÌˆwer_Titanic.jpg align="right" width="15%" style="margin-right:10%"></div>

#### August 18, 2016 - Women in Data Science ATX Meetup - "Data Science from Scratch" Workshop #6

# Hypothesis Testing on the Titanic Data Set with Python

## 0. Preliminaries

### 0.1 Load Python modules

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

sns.set_style('whitegrid')
%matplotlib inline

In [3]:
# Print version info
import sys
import matplotlib as mpl
print("python " + sys.version)
print("")
print("pandas " + str(pd.__version__))
print("numpy " + np.__version__)
print("matplotlib " + mpl.__version__)
print("seaborn " + sns.__version__)

python 3.5.2 |Anaconda custom (x86_64)| (default, Jul  2 2016, 17:52:12)
[GCC 4.2.1 Compatible Apple LLVM 4.2 (clang-425.0.28)]

pandas 0.18.1
numpy 1.10.4
matplotlib 1.5.1
seaborn 0.7.0

## 1. Set the hypotheses

## 2. Check assumptions and conditions

In [19]:
train = pd.read_csv("data/train.csv")  # read in Titanic training data csv file to pandas data frame
print(len(train))                      # print number of observations in dataset
train.head()                           # display first 5 rows of data frame

891

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
train = train[['Survived', 'Age', 'Sex', 'Pclass']] # select 4 columns of data frame
train.head()

   Survived   Age     Sex  Pclass
0         0  22.0    male       3
1         1  38.0  female       1
2         1  26.0  female       3
3         1  35.0  female       1
4         0  35.0    male       3